<?php

return [
    'daemon_connection_failed' => 'daemon_connection_failed' => 'Під час спроби зв’язку з демоном стався виняток, що призвів до коду відповіді коду HTTP /:. Цей виняток було зареєстровано. ',
    'node' => [
          'servers_attached' => 'Вузол не повинен мати пов\'язаних із ним серверів, щоб бути видаленим.',
        'daemon_off_config_updated' => 'Конфігурація демона <strong> оновлена</strong>, однак сталася помилка під час спроби автоматичного оновлення файлу конфігурації демона. Вам потрібно буде вручну оновити файл конфігурації (config.yml) для демона, щоб застосувати ці зміни. ',
          ],
    'allocations' => [
          'server_using' => 'Наразі для цього розподілу призначений сервер. Розподіл може бути видалений лише в тому випадку, якщо в даний час не призначено жодного сервера.'
          'too_many_ports' => 'Додавання більше 1000 портів в одному діапазоні одночасно не підтримується.',
          'invalid_mapping' => 'Передбачене відображення: порт був недійсним і не може бути оброблений.',
          'cidr_out_of_range' => 'Позначення CIDR допускає лише маски від / 25 до / 32.',
          'port_out_of_range' => 'Порти у розподілі повинні бути більше 1024 і менше або дорівнювати 65535.',
    ],
    'nest' => [
        'delete_has_servers' => 'Гніздо з приєднаними до нього активними серверами не можна видалити з панелі.',
        'egg' => [
            'delete_has_servers' => 'Яйце з приєднаними до нього активними серверами не можна видалити з панелі.',
            'invalid_copy_id' => 'Яйце, вибране для копіювання скрипта, або не існує, або копіює сам сценарій.',
            'must_be_child' => 'Директива "Копіювати налаштування з" для цього яйця повинна бути дочірньою опцією для вибраного гнізда.'
            'has_children' => 'Це яйце є батьківським для одного або кількох інших яєць. Будь ласка, видаліть ці яйця перед тим, як видалити це яйце. ',
        ],
        'variables' => [
            'env_not_unique' => 'Змінна середовища: ім\'я має бути унікальним для цього яйця.',
            'reserve_name' => 'Змінна середовища: ім\'я захищене і не може бути призначене змінній.',
            'bad_validation_rule' => 'Правило перевірки ": правило" не є дійсним правилом для цієї програми.',
        ],
        'importer' => [
             'json_error' => 'Під час спроби проаналізувати файл JSON сталася помилка:: error.',
            'file_error' => 'Наданий файл JSON був недійсним.',
            'invalid_json_provided' => 'Наданий файл JSON не у форматі, який можна розпізнати.',
        ],
    ],
    'subusers' => [
         'editing_self' => 'Редагувати власний акаунт субкористувача заборонено.',
        'user_is_owner' => 'Ви не можете додати власника сервера як субкористувача для цього сервера.',
        'subuser_exists' => 'Користувач з цією адресою електронної пошти вже призначений в якості субкористувача для цього сервера.',
    ],
    'databases' => [
         'delete_has_databases' => 'Не вдається видалити сервер хоста бази даних, до якого пов\'язані активні бази даних.',
    ],
    'tasks' => [
        'chain_interval_too_long' => 'Максимальний час інтервалу для ланцюгового завдання становить 15 хвилин.',
    ],
    'locations' => [
         'has_nodes' => 'Не вдається видалити розташування, до якого приєднані активні вузли.',
    ],
    'users' => [
         'node_revocation_failed' => 'Не вдалося відкликати ключі на <a href=":link"> Вузол #: вузол </a>. : помилка ',
    ],
    'deployment' => [
         'no_viable_nodes' => 'Не вдалося знайти вузлів, що відповідають вимогам, визначеним для автоматичного розгортання.',
        'no_viable_allocations' => 'Розподілів, що відповідають вимогам до автоматичного розгортання, не знайдено.',
    ],
    'api' => [
        'resource_not_found' => 'Запитаний ресурс не існує на цьому сервері.',
    ],
];
