<?php
/**
 * Pterodactyl - Panel
 * Copyright (c) 2015 - 2017 Dane Everitt <dane@daneeveritt.com>.
 *
 * This software is licensed under the terms of the MIT license.
 * https://opensource.org/licenses/MIT
 */

return [
    'validation' => [
           'fqdn_not_resolvable' => 'Надане повне доменне ім\'я або IP-адреса не перетворюється на дійсну IP-адресу.',
        'fqdn_required_for_ssl' => 'Для використання SSL для цього вузла потрібне повне доменне ім\'я, яке перетворюється на загальнодоступну IP-адресу.',
    ],
    'notices' => [
         'allocations_added' => 'Розподіли успішно додані до цього вузла.',
        'node_deleted' => 'Вузол успішно видалено з панелі.',
        'location_required' => 'Перш ніж ви зможете додати вузол на цю панель, вам слід налаштувати принаймні одне розташування.',
        'node_created' => 'Новий вузол створено. Ви можете автоматично налаштувати демон на цій машині, перейшовши на вкладку \ \'Конфігурація \ \'. <strong> Перш ніж ви зможете додати будь-які сервери, спочатку слід призначити принаймні одну IP-адресу та порт. </strong> ',
        'node_updated' => 'Інформація про вузол оновлена. Якщо будь-які налаштування демона були змінені, вам потрібно буде перезавантажити його, щоб ці зміни набрали чинності. ',
        'unallocated_deleted' => 'Видалено всі нерозподілені порти для <code>: ip </code>.',
    ],
];
