<?php

return [
    /*
    |--------------------------------------------------------------------------
    | パスワードリセット言語行
    |--------------------------------------------------------------------------
    |
    | 以下の言語行は、デフォルトの行であり、理由に一致します
    | パスワードブローカーによってパスワードの更新試行が失敗したため
    | たとえば、トークンが無効または新しいパスワードが無効です。
    |
    */
    'password' => 'パスワードは少なくとも6文字で、確認と一致する必要があります',
    'reset' => 'パスワードがリセットされました！',
    'sent' => 'パスワードリセットリンクをメールで送信しました！',
    'token' => 'このパスワードリセットトークンは無効です',
    'user' => "そのメールアドレスのユーザーが見つかりません。",
];

