{
  "2fa": {
    "dashboard_title": "TEConfigure Two Factor",
    "dashboard_desc_enabled": "TETwo-factor authentication is currently enabled on your account",
    "dashboard_desc_disabled": "TEYou do not currently have two-factor authentication enabled on your account. Click the button below to begin configuring it.",
    "disable_password_desc": "TEIn order to disable two-factor authentication you will need to provide your account password.",
    "forced_title": "TE2-Factor Required",
    "forced_desc": "TEYour account must have two-factor authentication enabled in order to continue.",
    "setup": {
      "input_title": "TECode From Authenticator",
      "input_desc": "TEEnter the code from your authenticator device after scanning the QR image.",
      "qr_alternative_desc": "TEAlternatively, enter the following token into your authenticator application:",
      "enabled_title": "TETwo-factor authentication enabled",
      "enabled_desc": "TETwo-factor authentication has been enabled on your account. Should you lose access to your authenticator device, you'll need to use one of the codes displayed below in order to access your account.",
      "store_securely": "TE<bold>These codes will not be displayed again.</bold> Please take note of them now by storing them in a secure repository such as a password manager."
    },
    "validation": {
      "code_required": "TEYou must provide an authentication code to continue.",
      "code_length": "TEAuthenticator code must be 6 digits."
    }
  },

  "api": {
    "page_title": "TEAccount API",
    "create": "TECreate API Key",
    "required": "TEYou must provide a description in order to continue",
    "valid": "TEYour description must be at least 4 characters in length",
    "title": "TEAPI Keys",
    "delete_title": "TEConfirm key deletion",
    "delete_button": "TEYes, delete key",
    "delete_desc": "TEConfirm key deletion",
    "no_keys": "TENo API keys exist for this account.",
    "last_used": "TELast used: ",
    "new_title": "TEYour API Key",
    "new_desc": "TEThe API key you have requested is shown below. Please store this in a safe location, it will not be shown again.",
    "key_desc": "TEAre you sure you wish to delete this API key? All requests using it will immediately be invalidated and will fail.",
    "allowed_ips_title": "TEAllowed IPs",
    "allowed_ips_desc": "TELeave blank to allow any IP address to use this API key, otherwise provide each IP address on a new line."
  },

  "password": {
    "update": "TEUpdate Password",
    "required": "TEYou must provide your current password in order to continue.",
    "confirm": "TEConfirm Password",
    "confirm_failed": "TEPassword confirmation does not match the password you entered.",
    "current": "TECurrent Password",
    "new": "TENew Password",
    "new_desc": "TEYour new password should be at least 8 characters in length and unique to this website.",
    "new_confirm": "TEConfirm New Password",
    "valid": "TEYour new password must be at least 8 characters in length"
  },

  "email": {
    "update": "TEUpdate Email Address",
    "updated": "TEYour primary email has been updated.",
    "required": "TEYou must provide an email address in order to continue",
    "valid": "TEYou must provide an valid email address in order to continue"
  },
  
  "page_title": "TEAccount Overview"
}