<?php

return [
    'email' => [
        'title' => 'Оновіть свою електронну адресу',
        'updated' => 'Вашу електронну адресу оновлено.',
    ],
    'password' => [
        'title' => 'Змінити пароль',
        'requirements' => 'Ваш новий пароль повинен містити щонайменше 8 символів.',
        'updated' => 'Ваш пароль оновлений.',
    ],
    'two_factor' => [
        'button' => 'Налаштувати двофакторну автентифікацію',
        'disabled' => 'Двофакторну автентифікацію у вашому обліковому записі вимкнено. Вам більше не буде запропоновано вводити маркер під час входу в систему. ',
        'enabled' => 'У вашому обліковому записі ввімкнено двофакторну автентифікацію! Відтепер при вході в систему вам потрібно буде надати код, згенерований вашим пристроєм. ',
        'invalid' => 'Наданий маркер був недійсним.',
        'setup' => [
            'title' => 'Налаштувати двофакторну автентифікацію',
            'help' => 'Не вдається просканувати код? Введіть код нижче у своїй заявці: ',
            'field' => 'Ввести маркер',
        ],
        'disable' => [
            'title' => 'Вимкнути двофакторну автентифікацію',
            'field' => 'Ввести маркер',
        ],
    ],
];
