<?php
/**
 * Pterodactyl - Panel
 * Copyright (c) 2015 - 2017 Dane Everitt <dane@daneeveritt.com>.
 *
 * This software is licensed under the terms of the MIT license.
 * https://opensource.org/licenses/MIT
 */

return [
    'notices' => [
        'created' => 'Новое гнездо :name успешно создано.',
        'deleted' => 'Успешно удалили запрошенное гнездо с панели.',
        'updated' => 'Успешно обновлены параметры конфигурации гнезда.',
    ],
    'eggs' => [
        'notices' => [
            'imported' => 'Успешно импортировано это яйцо и связанные с ним переменные.',
            'updated_via_import' => 'Это яйцо было обновлено с использованием предоставленного файла.',
            'deleted' => 'Успешно удалили запрошенное яйцо из панели.',
            'updated' => 'Конфигурация яйца успешно обновлена.',
            'script_updated' => 'Сценарий установки Egg обновлен и будет запускаться всякий раз, когда будут установлены серверы.',
            'egg_created' => 'Новое яйцо было добавлено успешно. Вам нужно будет перезапустить все работающие демоны, чтобы применить это новое яйцо.',
        ],
    ],
    'variables' => [
        'notices' => [
            'variable_deleted' => 'Переменная ":variable" была удалена и больше не будет доступна серверам после восстановления.',
            'variable_updated' => 'Переменная ":variable" была обновлена. Вам нужно будет перестроить все серверы, использующие эту переменную, чтобы применить изменения.',
            'variable_created' => 'Новая переменная была успешно создана и назначена этому яйцу.',
        ],
    ],
];
