<?php
return array(
	"confirmpassword" => "Подтвердить пароль",
	"emailsent" => "Письмо со сбросом пароля Вам отправлено.",
	"errorencountered" => "Произошла ошибка при попытке обработать этот запрос.",
	"failed" => "Эти учетные данные не соответствуют нашим записям.",
	"remeberme" => "Запомнить меня",
	"resetpassword" => "Сброс пароля",
	"sendlink" => "Выслать ссылку для сброса пароля",
	"throttle" => "Слишком много попыток входа. Попробуйте снова через :seconds секунд.",
	"totp_failed" => "TOTP токен недействителен. Пожалуйста, убедитесь, что токен, сформированный устройством является действительным.",
);