<?php

return [
    'not_authorized' => 'Вы не авторизованы для выполнения этого действия.',
    'auth_error' => 'Произошла ошибка при попытке войти.',
    'authentication_required' => 'Для продолжения требуется Аутентификация.',
    'remember_me' => 'Запомнить меня',
    'sign_in' => 'Войти в систему',
    'forgot_password' => 'Я забыл свой пароль!',
    'request_reset_text' => 'Забыли пароль учетной записи? Это не конец света, просто укажите свой адрес электронной почты.',
    'reset_password_text' => 'Сбросить пароль вашей учетной записи.',
    'reset_password' => 'Сбросить пароль учетной записи',
    'email_sent' => 'Вам отправлено электронное письмо с дальнейшими инструкциями по восстановлению пароля.',
    'failed' => 'Предоставленные учетные данные не совпадают с теми, которые есть у нас в записи, или предоставленный токен 2FA недействителен.',
    'throttle' => 'Слишком много попыток входа в систему. Пожалуйста, повторите попытку через :seconds секунд.',
    'password_requirements' => 'Пароли должны содержать как минимум одну заглавную, строчную букву, цифры и содержать не менее 8 символов.',
    'request_reset' => 'Найти аккаунт',
    '2fa_required' => 'Двухфакторная аутентификация',
    '2fa_failed' => 'Указанный токен 2FA недействителен.',
    'totp_failed' => 'Произошла ошибка при попытке проверить TOTP.',
    '2fa_must_be_enabled' => 'Администратор потребовал, чтобы для вашей учетной записи была включена двухфакторная аутентификация, чтобы использовать панель.',
];
