<?php

return [
    'daemon_connection_failed' => 'При попытке установить связь с демоном возникла исключительная ситуация, в результате которой был получен код ответа HTTP /:code. Это исключение было зарегистрировано.',
    'node' => [
        'servers_attached' => 'Узел не должен иметь серверов, связанных с ним, для удаления.',
        'daemon_off_config_updated' => 'Конфигурация демона <strong>была обновлена</strong>, однако при попытке автоматического обновления файла конфигурации в демоне произошла ошибка. Вам нужно будет вручную обновить файл конфигурации (core.json), чтобы демон применил эти изменения.',
    ],
    'allocations' => [
        'server_using' => 'Сервер в настоящее время назначен на это распределение. Распределение может быть удалено, только если в данный момент не назначен сервер.',
        'too_many_ports' => 'Добавление более 1000 портов в одном диапазоне одновременно не поддерживается.',
        'invalid_mapping' => 'Отображение, предусмотренное для :port, было недействительным и не могло быть обработано.',
        'cidr_out_of_range' => 'Нотация CIDR допускает маски только от / 25 до / 32.',
        'port_out_of_range' => 'Порты в распределении должны быть больше 1024 и меньше или равны 65535.',
    ],
    'nest' => [
        'delete_has_servers' => 'Гнездо с подключенными к нему активными серверами нельзя удалить с панели.',
        'egg' => [
            'delete_has_servers' => 'Яйцо с подключенными к нему активными серверами нельзя удалить с панели.',
            'invalid_copy_id' => 'Яйцо, выбранное для копирования скрипта, либо не существует, либо копирует сам скрипт.',
            'must_be_child' => 'Директива "Copy Settings From" для этого яйца должна быть дочерней для выбранного гнезда.',
            'has_children' => 'Это яйцо является родителем одного или нескольких других яиц. Пожалуйста, удалите эти яйца перед удалением этого яйца.',
        ],
        'variables' => [
            'env_not_unique' => 'Переменная окружения :name должно быть уникальным для этого яйца.',
            'reserved_name' => 'Переменная среды :name защищено и не может быть присвоено переменной.',
            'bad_validation_rule' => 'Правило проверки ":rule" не является допустимым правилом для этого приложения.',
        ],
        'importer' => [
            'json_error' => 'Произошла ошибка при попытке проанализировать файл JSON: :error.',
            'file_error' => 'Предоставленный файл JSON недействителен.',
            'invalid_json_provided' => 'Предоставленный файл JSON не в формате, который может быть распознан.',
        ],
    ],
    'packs' => [
        'delete_has_servers' => 'Невозможно удалить пакет, прикрепленный к активным серверам.',
        'update_has_servers' => 'Невозможно изменить идентификатор связанной опции, когда серверы в данный момент подключены к пакету.',
        'invalid_upload' => 'Предоставленный файл не является действительным.',
        'invalid_mime' => 'Предоставленный файл не соответствует требуемому типу :type',
        'unreadable' => 'Предоставленный архив не может быть открыт сервером.',
        'zip_extraction' => 'Возникла исключительная ситуация при попытке извлечь архив, предоставленный на сервер.',
        'invalid_archive_exception' => 'В архиве пакета отсутствует требуемый файл archive.tar.gz или import.json в базовом каталоге.',
    ],
    'subusers' => [
        'editing_self' => 'Редактирование вашей учетной записи подпользователя запрещено.',
        'user_is_owner' => 'Вы не можете добавить владельца сервера в качестве подпользователя для этого сервера.',
        'subuser_exists' => 'Пользователь с таким адресом электронной почты уже назначен в качестве подпользователя для этого сервера.',
    ],
    'databases' => [
        'delete_has_databases' => 'Невозможно удалить хост-сервер базы данных, с которым связаны активные базы данных.',
    ],
    'tasks' => [
        'chain_interval_too_long' => 'Максимальный интервал времени для связанной задачи составляет 15 минут.',
    ],
    'locations' => [
        'has_nodes' => 'Невозможно удалить местоположение, к которому прикреплены активные узлы.',
    ],
    'users' => [
        'node_revocation_failed' => 'Не удалось отозвать ключи на <a href=":link">Node #:node</a>. :error',
    ],
    'deployment' => [
        'no_viable_nodes' => 'Узлы, удовлетворяющие требованиям, указанным для автоматического развертывания, не найдены.',
        'no_viable_allocations' => 'Местоположений, удовлетворяющих требованиям для автоматического развертывания, обнаружено не было.',
    ],
    'api' => [
        'resource_not_found' => 'Запрашиваемый ресурс не существует на этом сервере.',
    ],
];
