<?php
return array(
	"ajax" => array(
		"socket_error" => "Нам не удалось подключиться к Socket.IO сервера, из за проблемы сети. Панель может работать не так, как ожидалось.",
		"socket_status" => "Этот сервер изменил статус на",
		"socket_status_crashed" => "Этот сервер определен как CRASHED.",
	),
	"files" => array(
		"back" => "Обратно в Файлменеджер",
		"loading" => "Загружается список файлов, подождите несколько секунд...",
		"saved" => "Файл успешно сохранен.",
		"yaml_notice" => "Вы редактируете YAML файл. Вместо символов табуляции используйте  :dropdown пробелы.",
	),
	"index" => array(
		"add_new" => "Добавить новый сервер",
		"allocation" => "Распределение",
		"command" => "Введите команду консоли",
		"connection" => "Соединение по умолчанию",
		"control" => "Управление сервером",
		"cpu_use" => "Использование процессора",
		"disk_space" => "Дисковое пространство",
		"memory_use" => "Использование памяти",
		"mem_limit" => "Лимит памяти",
		"server_info" => "Информация о сервере",
		"usage" => "Использование",
		"xaxis" => "Время (2с интервал)",
	),
);